{
  "project": "Copy Anuncios ML",
  "branchName": "ralph/ux-improvements",
  "description": "Melhorias de UX: status em tempo real no histórico (cópia e compat), SKU no preview de compatibilidades com botão copiar, e seleção de seller de origem com checkboxes na CopyPage",
  "userStories": [
    {
      "id": "US-001",
      "title": "Backend: copy_logs in_progress status for copy operations",
      "description": "As a developer, I want the copy flow to create a log entry with status in_progress before starting the operation and update it to the final status after completion, so the frontend can show real-time progress",
      "acceptanceCriteria": [
        "In app/services/item_copier.py, modify the copy_items function to insert a row into copy_logs with status 'in_progress' BEFORE starting the copy operation for each source item",
        "The in_progress log row includes: source_seller, dest_sellers, source_item_id, status='in_progress', created_at",
        "After copy completes (success, error, or partial), UPDATE the same row with final status, dest_item_ids, and error_details",
        "Use the row's id to update the correct log entry (store the id returned from insert)",
        "If the copy_logs table status column has a CHECK constraint that doesn't include 'in_progress', update it to allow the new value",
        "Existing GET /api/copy/logs endpoint returns in_progress rows naturally (no changes needed there)",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "The copy_logs table is in Supabase. Use get_db() from app/db/supabase.py. Current log creation is at the end of copy_single_item (lines ~623-635 in item_copier.py). Move the insert to before the operation and add an update after. Pattern: row = db.table('copy_logs').insert({...status:'in_progress'...}).execute(); then later db.table('copy_logs').update({status:'success',...}).eq('id', row.data[0]['id']).execute()"
    },
    {
      "id": "US-002",
      "title": "Backend: compat_logs in_progress status for compat operations",
      "description": "As a developer, I want the compat copy flow to create a log entry with status in_progress before starting the background task and update it after completion, so the frontend can show real-time progress",
      "acceptanceCriteria": [
        "In app/routers/compat.py POST /api/compat/copy endpoint, create the compat_logs row with status 'in_progress' BEFORE adding the background task",
        "The in_progress log row includes: source_item_id, skus, targets (as JSONB with each target having status 'pending'), total_targets, success_count=0, error_count=0, status='in_progress'",
        "Pass the log row id to the background task function so it can update the row when done",
        "In app/services/compat_copier.py copy_compat_to_targets, accept an optional log_id parameter and UPDATE the compat_logs row with final results (status, success_count, error_count, updated targets with per-target status)",
        "If compat_logs table needs a status column, add it (currently it may not have one — check and add via migration if needed)",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": "The compat copy currently uses FastAPI BackgroundTasks. The key is: create the log row synchronously in the endpoint (before background_tasks.add_task), then pass log_id to the background function. Check compat_logs schema in app/db/migrations/ — it may not have a 'status' column yet. If missing, add a migration file. Also check app/routers/compat.py and app/services/compat_copier.py for current logging pattern."
    },
    {
      "id": "US-003",
      "title": "Backend: Add SKUs to compat preview endpoint",
      "description": "As a developer, I want the compat preview endpoint to return SKUs from the item so the frontend can display and allow copying them",
      "acceptanceCriteria": [
        "Modify GET /api/compat/preview/{item_id} in app/routers/compat.py to include a 'skus' field in the response",
        "Extract SKU from item-level seller_custom_field if present",
        "Extract SKUs from each variation's seller_custom_field or SELLER_SKU attribute",
        "Return deduplicated array of all found SKUs (e.g. ['SKU001', 'SKU002'])",
        "Return empty array if no SKUs found",
        "Existing preview fields (id, title, thumbnail, has_compatibilities, compat_count) remain unchanged",
        "Typecheck passes"
      ],
      "priority": 3,
      "passes": true,
      "notes": "The item data from ML API has: item.seller_custom_field (item-level SKU) and item.variations[].seller_custom_field or item.variations[].attributes where id='SELLER_SKU'. Use get_item() which returns full item data including variations. Deduplicate with list(set(skus)) and filter out None/empty strings."
    },
    {
      "id": "US-004",
      "title": "Frontend: CopyPage history shows in_progress status with polling",
      "description": "As an operator, I want to see a visual 'em andamento' indicator in the CopyPage history when a copy operation is running, with automatic updates when it completes",
      "acceptanceCriteria": [
        "In frontend/src/pages/CopyPage.tsx, after submitting a copy operation, immediately call loadLogs() to refresh history (the backend now creates in_progress rows before starting)",
        "Rows with status 'in_progress' display a distinct visual indicator: a pulsing dot or spinner with text 'Copiando...' in a blue/yellow badge",
        "While any row has status 'in_progress', poll GET /api/copy/logs every 5 seconds to check for updates",
        "Stop polling once no rows have status 'in_progress'",
        "When a row transitions from in_progress to final status (success/error/partial), the UI updates automatically via the polling refresh",
        "Use CSS variables from existing design system (--ink, --surface, --line, etc.) for the in_progress indicator styling",
        "Typecheck passes"
      ],
      "priority": 4,
      "passes": true,
      "notes": "CopyPage.tsx has a loadLogs() function and logs state. The history table is rendered around lines 94-139. Add a useEffect with setInterval for polling. Use a useRef to track the interval. Clear interval when no in_progress rows remain. For the visual indicator, consider a CSS @keyframes pulse animation on the status badge."
    },
    {
      "id": "US-005",
      "title": "Frontend: CompatPage history shows in_progress status with polling",
      "description": "As an operator, I want to see a visual 'em andamento' indicator in the CompatPage history when a compat copy operation is running, with automatic updates when it completes",
      "acceptanceCriteria": [
        "In frontend/src/pages/CompatPage.tsx, after submitting a compat copy, immediately call the logs fetch function to refresh history",
        "Rows with status 'in_progress' display a distinct visual indicator: a pulsing dot or spinner with text 'Copiando...' in a blue/yellow badge",
        "While any row has status 'in_progress', poll GET /api/compat/logs every 5 seconds to check for updates",
        "Stop polling once no rows have status 'in_progress'",
        "When a row transitions from in_progress to final status, the UI updates automatically via the polling refresh",
        "Remove any existing hardcoded setTimeout-based refresh logic (e.g., 5s/15s/30s timers) in favor of the new polling approach",
        "Use CSS variables from existing design system for the in_progress indicator styling",
        "Typecheck passes"
      ],
      "priority": 5,
      "passes": true,
      "notes": "CompatPage.tsx currently has auto-refresh logic using setTimeout at 5s, 15s, 30s intervals. Replace that with a cleaner polling approach: setInterval every 5s while in_progress rows exist. Same visual pattern as CopyPage (US-004). Check how compat_logs are currently displayed and add the status field to the rendering."
    },
    {
      "id": "US-006",
      "title": "Frontend: Display SKUs in CompatPage preview with copy-to-clipboard button",
      "description": "As an operator, I want to see the SKU(s) of the source item in the CompatPage preview and copy them to clipboard with one click, so I can paste them into the SKU search field",
      "acceptanceCriteria": [
        "In frontend/src/pages/CompatPage.tsx, display the skus array from the preview API response below the existing preview card info",
        "Each SKU is shown as a tag/chip with a copy icon button next to it",
        "Clicking the copy button calls navigator.clipboard.writeText() with that SKU value",
        "After copying, show brief visual feedback: icon changes to a checkmark or text 'Copiado!' for 2 seconds",
        "If multiple SKUs exist, show all of them each with their own copy button",
        "If skus array is empty, show 'Sem SKU' in muted/gray text",
        "Use existing CSS design system variables for styling",
        "Typecheck passes"
      ],
      "priority": 6,
      "passes": true,
      "notes": "The preview API now returns a 'skus' field (array of strings) from US-003. The preview card is rendered in CompatPage.tsx. Use navigator.clipboard.writeText() for clipboard — no fallback needed for modern browsers. For the copy feedback, use a useState with setTimeout to reset after 2s."
    },
    {
      "id": "US-007",
      "title": "Frontend: Checkbox-based origin seller selection in CopyPage",
      "description": "As an operator, I want to select the origin seller using checkboxes (same visual style as destination sellers) with single-select behavior where unselected sellers become grayed out",
      "acceptanceCriteria": [
        "In frontend/src/components/CopyForm.tsx, replace the SellerSelect dropdown for origin seller with checkbox-style buttons matching the destination sellers layout",
        "Only one seller can be selected as origin at a time (single-select behavior)",
        "When a seller is selected as origin, all other sellers in the origin section become visually disabled (opacity reduced, gray color, cursor not-allowed)",
        "Clicking the already-selected seller deselects it, making all sellers available again",
        "The selected origin seller is still excluded from the destination checkboxes (existing behavior preserved)",
        "Reuse the same visual component/style used for destination seller checkboxes, but with single-select logic",
        "Use existing CSS design system variables for disabled/active states",
        "Typecheck passes"
      ],
      "priority": 7,
      "passes": false,
      "notes": "CopyForm.tsx currently uses <SellerSelect> (a dropdown) for origin and checkbox-style buttons for destinations. Look at how destination sellers are rendered (the availableDestinations.map section) and replicate that pattern for origin, but with single-select: clicking one disables others visually. The key CSS: when a seller is not the selected one and source is set, apply opacity: 0.4, pointer-events: none or similar."
    }
  ]
}
